LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
/**
  ******************************************************************************
  * @file    gd32f20x_eth.c
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   ETH functions of the firmware library.
  ******************************************************************************
  */ 
#ifdef GD32F20X_CL
/* Includes ------------------------------------------------------------------*/
#include "gd32f20x_eth.h"
#include "gd32f20x_rcc.h"

/** @addtogroup GD32F20x_Firmware
  * @{
  */

/** @defgroup ETH 
  * @brief ETH driver modules
  * @{
  */ 

/** @defgroup ETH_Private_Defines
  * @{
  */ 
  
/* Global transmit and receive descriptors pointers */
ETH_DMADESCTypeDef  *DMACurrentTxDesc;
ETH_DMADESCTypeDef  *DMACurrentRxDesc;
ETH_DMADESCTypeDef  *DMACurrentPTPTxDesc;
ETH_DMADESCTypeDef  *DMACurrentPTPRxDesc;

/* ETHERNET MAC address offsets */
#define ETH_MAC_ADDR_HBASE                              (ETH_MAC_BASE + 0x40)   /* ETHERNET MAC address high offset */
#define ETH_MAC_ADDR_LBASE                              (ETH_MAC_BASE + 0x44)   /* ETHERNET MAC address low offset */

/* ETHERNET MAC_PHYAR register Mask */
#define MAC_PHYAR_CLR_MASK                              ((uint32_t)0xFFFFFFE3) 

/* ETHERNET MAC_PHYAR register PHY address shift */
#define MAC_PHYAR_PHYADDRSHIFT                          11

/* ETHERNET MAC_PHYAR register PHY register shift */
#define MAC_PHYAR_PHYREGSHIFT                           6

/* ETHERNET MAC_CFR register Mask */
#define MAC_CFR_CLEAR_MASK                              ((uint32_t)0xFF20810F)  

/* ETHERNET MAC_FCTLR register Mask */
#define MAC_FCTLR_CLEAR_MASK                            ((uint32_t)0x0000FF41)

/* ETHERNET DMA_CTLR register Mask */
#define DMA_CTLR_CLEAR_MASK                             ((uint32_t)0xF8DE3F23)

/* ETHERNET Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH                      8

/* ETHERNET Missed frames counter Shift */
#define  ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT  17

/* ETHERNET DMA Tx descriptors Collision Count Shift */
#define  ETH_DMATXDESC_COLLISION_COUNTSHIFT             3

/* ETHERNET DMA Tx descriptors size */
#define  ETH_DMATXDESC_SIZE                             0x10

/* ETHERNET DMA Rx descriptors size */
#define  ETH_DMARXDESC_SIZE                             0x10

/* ETHERNET DMA Tx descriptors Buffer2 Size Shift */
#define  ETH_DMATXDESC_BUFFER2_SIZESHIFT                16

/* ETHERNET DMA Rx descriptors Frame Length Shift */
#define  ETH_DMARXDESC_FRAME_LENGTHSHIFT                16

/* ETHERNET DMA Rx descriptors Buffer2 Size Shift */
#define  ETH_DMARXDESC_BUFFER2_SIZESHIFT                16

/* ETHERNET errors */
#define  ERROR                                          ((uint32_t)0)
#define  SUCCESS                                        ((uint32_t)1)
/**
  * @}
  */

/** @defgroup ETH_Private_FunctionPrototypes
  * @{
  */ 
  
#ifndef USE_Delay
static void ETH_Delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
  
/**
  * @}
  */

/** @defgroup ETH_Private_Functions
  * @{
  */

/**
  * @brief  Reset the ETH registers.
  * @param  None 
  * @retval None
  */
void ETH_DeInit(void)
{
    RCC_AHBPeriphReset_Enable(RCC_AHBPERIPH_ETH_MAC, ENABLE);
    RCC_AHBPeriphReset_Enable(RCC_AHBPERIPH_ETH_MAC, DISABLE);
}

/**
  * @brief  Initialize MDIO parameters.
  * @param  None 
  * @retval None
  */
void ETH_MDIOInit(void) 
{
    uint32_t temp = 0;
    RCC_ClocksPara  rcc_clocks;
    uint32_t hclk;
    
    /* ETHERNET MAC_PHYAR Configuration */
    /* Get the ETH_MAC_PHYAR value */
    temp = ETH_MAC->PHYAR;
    /* Clear Clock Range CLR[2:0] bits */
    temp &= MAC_PHYAR_CLR_MASK;
    /* Get hclk frequency value */
    RCC_GetClocksFreq(&rcc_clocks);
    hclk = rcc_clocks.AHB_Frequency;
    /* Set CLR bits depending on hclk value */
    if((hclk >= 20000000)&&(hclk < 35000000))
    {
        /* Clock Range between 20-35 MHz */
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV16;
    }
    else if((hclk >= 35000000)&&(hclk < 60000000))
    {
        /* Clock Range between 35-60 MHz */ 
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV26;    
    }
    else if((hclk >= 60000000)&&(hclk < 90000000))
    {
        /* Clock Range between 60-90 MHz */ 
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV42;    
    }
    /* ((hclk >= 90000000)&&(hclk <= 108000000)) */    
    else 
    {
        /* Clock Range between 90-108 MHz */   
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV64;    
    }
    /* Write to ETHERNET MAC PHYAR */
    ETH_MAC->PHYAR = (uint32_t)temp;
}

/**
  * @brief  Initial the ETH parameters.
  * @param  ETH_InitParaStruct: The ETH_InitPara structure pointer.
  * @param  PHYAddress: external PHY address                    
  * @retval The Initialize result(ERROR or SUCCESS)                 
  */
uint32_t ETH_Init(ETH_InitPara* ETH_InitParaStruct, uint16_t PHYAddress)
{
    uint32_t RegValue = 0, temp = 0;
    __IO uint32_t i = 0;
    RCC_ClocksPara  rcc_clocks;
    uint32_t hclk;
    __IO uint32_t timeout = 0;       
   
    /* MAC Config */   
    /* ETH_MAC_PHYAR Configuration */
    /* Get the ETH_MAC_PHYAR value */
    temp = ETH_MAC->PHYAR;
    /* Clear Clock Range CLR[2:0] bits */
    temp &= MAC_PHYAR_CLR_MASK;
    /* Get hclk frequency value */
    RCC_GetClocksFreq(&rcc_clocks);
    hclk = rcc_clocks.AHB_Frequency;
    /* Set CLR bits depending on hclk value */
    if((hclk >= 20000000)&&(hclk < 35000000))
    {
        /* Clock Range between 20-35 MHz */
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV16;
    }
    else if((hclk >= 35000000)&&(hclk < 60000000))
    {
        /* Clock Range between 35-60 MHz */ 
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV26;    
    } 
    else if((hclk >= 60000000)&&(hclk < 90000000))
    {
        /* Clock Range between 60-90 MHz */ 
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV42;    
    }
    /* ((hclk >= 90000000)&&(hclk <= 108000000)) */
    else 
    {
        /* Clock Range between 90-108 MHz */   
        temp |= (uint32_t)ETH_MAC_PHYAR_CLR_DIV64;    
    }
    ETH_MAC->PHYAR = (uint32_t)temp;  
    /* PHY initialization and configuration */
    /* Set the PHY into reset mode */
    if(!(ETH_SetPHYRegisterValue(PHYAddress, PHY_BCR, PHY_RESET)))
    {
        /* Return ERROR due to write timeout */
        return ERROR;
    }
  
