LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
        /* Enable DMA transmission */
        ETH_DMATransmission_Enable(ENABLE); 
        /* Enable DMA reception */
        ETH_DMAReception_Enable(ENABLE);   
    }
    else
    {
        /* Disable MAC transmit */  
        ETH_MACTransmission_Enable(DISABLE);
        /* Flush ETHERNET DMA Transmit FIFO */
        ETH_CleanTransmitFIFO();
        /* Disable MAC receive */  
        ETH_MACReception_Enable(DISABLE);
 
        /* Disable DMA transmission */
        ETH_DMATransmission_Enable(DISABLE); 
        /* Disable DMA reception */
        ETH_DMAReception_Enable(DISABLE);
    }     
}

/**
  * @brief  Send data of application buffer as a transmit packet.
  * @param  pbuf: Pointer to the application buffer.
  * @param  size: the application buffer size.
  * @retval The transmission result(ERROR or SUCCESS) 
  */
uint32_t ETH_HandleTxPkt(uint8_t *pbuf, uint16_t size)
{ 
    uint32_t offset = 0;
    
    /* Check the busy bit of Tx descriptor status */
    if((DMACurrentTxDesc->Status & ETH_DMATXDESC_BUSY) != (uint32_t)RESET)
    {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR;
    }
      
    for(offset=0; offset<size; offset++)       
    {
        (*(__IO uint8_t *)((DMACurrentTxDesc->Buffer1Addr) + offset)) = (*(pbuf + offset));
    }
            
    /* Setting the Frame Length */
    DMACurrentTxDesc->ControlBufferSize = (size & ETH_DMATXDESC_TB1S);
    /* Setting the segment of frame (ETH_DMATXDESC_LSG and ETH_DMATXDESC_FSG are SET that frame is transmitted in one descriptor) */    
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_LSG | ETH_DMATXDESC_FSG;
    /* Enable the DMA transmission */
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_BUSY;
    /* Check Tx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_TBU) != (uint32_t)RESET)
    {
        /* Clear TBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_TBU;
        /* Resume DMA transmission by writing to the TPER register*/
        ETH_DMA->TPER = 0;
    }
  
    /* Update the ETHERNET DMA current Tx descriptor pointer to the next Tx decriptor in DMA Tx decriptor talbe*/  
    /* Chained Mode */
    if((DMACurrentTxDesc->Status & ETH_DMATXDESC_TCHM) != (uint32_t)RESET)
    {     
        DMACurrentTxDesc = (ETH_DMADESCTypeDef*) (DMACurrentTxDesc->Buffer2NextDescAddr);    
    }
    /* Ring Mode */
    else 
    {  
        if((DMACurrentTxDesc->Status & ETH_DMATXDESC_TERM) != (uint32_t)RESET)
        {
            DMACurrentTxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->TDTAR);      
        }
        else
        {  
            DMACurrentTxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentTxDesc + ETH_DMATXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));
        }
    }
    /* Return SUCCESS */
    return SUCCESS;   
}

/**
  * @brief  Receive a packet data to application buffer.
  * @param  pbuf: Pointer on the application buffer.
  * @retval The Receive size(If framelength is equal to ERROR, the receiving unsuccessful)
  */
uint32_t ETH_HandleRxPkt(uint8_t *pbuf)
{ 
    uint32_t offset = 0, size = 0;
   
    /* Check the busy bit of Rx descriptor status */
    if((DMACurrentRxDesc->Status & ETH_DMARXDESC_BUSY) != (uint32_t)RESET)
    {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR; 
    }
  
    if(((DMACurrentRxDesc->Status & ETH_DMARXDESC_ERRS) == (uint32_t)RESET) && 
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_LDES) != (uint32_t)RESET) &&  
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FDES) != (uint32_t)RESET))  
    {      
        /* Get the Frame Length exclusive CRC */
        size = ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FRML) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4;
        for(offset=0; offset<size; offset++)       
        {
            (*(pbuf + offset)) = (*(__IO uint8_t *)((DMACurrentRxDesc->Buffer1Addr) + offset));
        }
    }
    else
    {
        /* Return ERROR */
        size = ERROR;
    }
    /* Enable reception */
    DMACurrentRxDesc->Status = ETH_DMARXDESC_BUSY; 
 
    /* Check Rx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_RBU) != (uint32_t)RESET)  
    {
        /* Clear RBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_RBU;
        /* Resume DMA reception by writing to the RPER register*/
        ETH_DMA->RPER = 0;
    }
  
    /* Update the ETHERNET DMA current Rx descriptor pointer to the next Rx decriptor in DMA Rx decriptor talbe*/      
    /* Chained Mode */
    if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RCHM) != (uint32_t)RESET)
    {      
        DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (DMACurrentRxDesc->Buffer2NextDescAddr);    
    }
    /* Ring Mode */
    else 
    {   
        if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RERR) != (uint32_t)RESET)
        {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->RDTAR);      
        }
        else
        { 
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentRxDesc + ETH_DMARXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));      
        }
    }
  
    /* Return Frame size or ERROR */
    return (size);  
}

/**
  * @brief  To obtain the received data length
  * @param  None
  * @retval Received frame length.
  */
uint32_t ETH_GetRxPktSize(void)
{
    uint32_t size = 0;
    
    if(((DMACurrentRxDesc->Status & ETH_DMARXDESC_BUSY) == (uint32_t)RESET) &&
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_ERRS) == (uint32_t)RESET) &&
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_LDES) != (uint32_t)RESET) &&
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FDES) != (uint32_t)RESET))
    {
        /* Get the size of the received data including CRC */
        size = ETH_GetDMARxDescFrameLength(DMACurrentRxDesc);
    }
 
    /* Return Packet size */ 
    return size;
}

/**
  * @brief  Discard a Received packet
  * @param  None
  * @retval None
  */
void ETH_DropRxPkt(void)
{
    /* Enable reception */
    DMACurrentRxDesc->Status = ETH_DMARXDESC_BUSY;  
    /* Chained Mode */
    if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RCHM) != (uint32_t)RESET)
    {
        DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (DMACurrentRxDesc->Buffer2NextDescAddr);
    }
    /* Ring Mode */
    else 
    {
        if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RERR) != (uint32_t)RESET)
        {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->RDTAR);
        }
        else
        {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentRxDesc + ETH_DMARXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));
        }
    }
}
 
