LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
    /* Get the selectecd MAC address high register */
    temp =(*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr));
    
    buf[5] = ((temp >> 8) & (uint8_t)0xFF);
    buf[4] = (temp & (uint8_t)0xFF);
    /* Get the selectecd MAC address low register */
    temp =(*(__IO uint32_t *) (ETH_MAC_ADDR_LBASE + addr));
    buf[3] = ((temp >> 24) & (uint8_t)0xFF);
    buf[2] = ((temp >> 16) & (uint8_t)0xFF);
    buf[1] = ((temp >> 8 ) & (uint8_t)0xFF);
    buf[0] = (temp & (uint8_t)0xFF);
}

/**
  * @brief  Enable or disable the Address perfect filtering.
  * @param  addr: the MAC address register selected for prfect filtering.
  *   Select one of the follwing values : 
  *     @arg ETH_MAC_ADDRESS1 : MAC Address1 
  *     @arg ETH_MAC_ADDRESS2 : MAC Address2
  *     @arg ETH_MAC_ADDRESS3 : MAC Address3
  * @param  NewValue: new value of the MAC address register selected for perfect filtering.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_MACAddressPerfectFilter_Enable(uint32_t addr, TypeState NewValue)
{   
    if (NewValue != DISABLE)
    {
        /* Enable the perfect filtering to the MAC address register selected */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) |= ETH_MAC_A1HR_AFE;
    }
    else
    {
        /* Disable the perfect filtering to the MAC address register selected */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) &=(~(uint32_t)ETH_MAC_A1HR_AFE);
    }
}

/**
  * @brief  Set the selected MAC address filter type mode. 
  * @param  addr: the MAC address to be used for filtering.
  *   Select one of the follwing values : 
  *     @arg ETH_MAC_ADDRESS1 : MAC Address1 
  *     @arg ETH_MAC_ADDRESS2 : MAC Address2
  *     @arg ETH_MAC_ADDRESS3 : MAC Address3
  * @param  Filterfield: the mode of receiving field for comparaison 
  *   Select one of the follwing values : 
  *     @arg ETH_MAC_ADDRESSFILTER_SA : Compare with the SA fields of the received frame.                                   
  *     @arg ETH_MAC_ADDRESSFILTER_DA : Compare with the DA fields of the received frame.                                   
  * @retval None
  */
void ETH_MACAddressFilterConfig(uint32_t addr, uint32_t Filterfield)
{ 
    if (Filterfield != ETH_MAC_ADDRESSFILTER_DA)
    {
        /* Compare with the SA fields of the received frame. */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) |= ETH_MAC_A1HR_SAF;
    }
    else
    {
        /* compare with the DA fields of the received frame. */
        (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) &=(~(uint32_t)ETH_MAC_A1HR_SAF);
    }
}

/**
  * @brief  Set the selected MAC address filter maskbyte.
  * @param  addr: the MAC address to be used for filtering 
  *   Select one of the follwing values :  
  *     @arg ETH_MAC_ADDRESS1 : MAC Address1 
  *     @arg ETH_MAC_ADDRESS2 : MAC Address2
  *     @arg ETH_MAC_ADDRESS3 : MAC Address3
  * @param addrmask: the address bytes be selected for address filtering comparaison 
  *   Select one of the follwing values :  
  *     @arg ETH_MAC_ADDRESSMASK_BYTE6 : Mask MAC Address high register bits [15:8].
  *     @arg ETH_MAC_ADDRESSMASK_BYTE5 : Mask MAC Address high register bits [7:0].
  *     @arg ETH_MAC_ADDRESSMASK_BYTE4 : Mask MAC Address low register bits [31:24].
  *     @arg ETH_MAC_ADDRESSMASK_BYTE3 : Mask MAC Address low register bits [23:16].
  *     @arg ETH_MAC_ADDRESSMASK_BYTE2 : Mask MAC Address low register bits [15:8].
  *     @arg ETH_MAC_ADDRESSMASK_BYTE1 : Mask MAC Address low register bits [7:0].
  * @retval None
  */
void ETH_MACAddressFilterMaskBytesConfig(uint32_t addr, uint32_t addrmask)
{
    /* Clear the MB bit of selected MAC address */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) &=(~(uint32_t)ETH_MAC_A1HR_MB);
    /* Set the mask bytes of selected Filetr */
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + addr)) |= addrmask;
}

/* DMA Tx/Rx Desciptors */

/**
  * @brief  Initialize the DMA Tx descriptors's parameters in chain mode.
  * @param  DMATxDescTab: Pointer to the first Tx descriptor table 
  * @param  pTxBuff: Pointer to the first TxBuffer table
  * @param  TxBuffCnt: the used Tx desc num in the table
  * @retval None
  */
void ETH_DMATxDescChainModeInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t* pTxBuff, uint32_t TxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMATxDesc;
  
    DMACurrentTxDesc = DMATxDescTab;
    /* Configuration each DMATxDesc descriptor */   
    for(num=0; num < TxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Tx Desc table */
        DMATxDesc = DMATxDescTab + num;
        /* Set TCH bit with desc status */
        DMATxDesc->Status = ETH_DMATXDESC_TCHM;  
       
        /* Set Buffer1 address pointer to application buffer */
        DMATxDesc->Buffer1Addr = (uint32_t)(&pTxBuff[num*ETH_MAX_FRAME_SIZE]);
    
        if(num < (TxBuffCnt-1))
        {
            /* Buffer2NextDescAddr equal to next descriptor address in the Tx Desc table */
            DMATxDesc->Buffer2NextDescAddr = (uint32_t)(DMATxDescTab+num+1);
        }
        else
        {
            /* When it is the last descriptor, Buffer2NextDescAddr equal to first descriptor address in the Tx Desc table */ 
            DMATxDesc->Buffer2NextDescAddr = (uint32_t) DMATxDescTab;  
        }
    }  
    ETH_DMA->TDTAR = (uint32_t) DMATxDescTab;
}

/**
  * @brief  Initialize the DMA Tx descriptors's parameters in ring mode.
  * @param  DMATxDescTab: Pointer to the first Tx descriptor table 
  * @param  pTxBuff1: Pointer to the first TxBuffer1 table 
  * @param  pTxBuff2: Pointer to the first TxBuffer2 table
  * @param  TxBuffCnt: the used Tx desc num in the table
  * @retval None
  */
void ETH_DMATxDescRingModeInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t *pTxBuff1, uint8_t *pTxBuff2, uint32_t TxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMATxDesc;
 
    DMACurrentTxDesc = DMATxDescTab;
    /* Configuration each DMATxDesc descriptor */   
    for(num=0; num < TxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Tx Desc table */
        DMATxDesc = DMATxDescTab + num;
        /* Set Buffer1 address pointer to application buffer1 */
        DMATxDesc->Buffer1Addr = (uint32_t)(&pTxBuff1[num*ETH_MAX_FRAME_SIZE]);
    
        /* Set Buffer2 address pointer to application buffer2 */
        DMATxDesc->Buffer2NextDescAddr = (uint32_t)(&pTxBuff2[num*ETH_MAX_FRAME_SIZE]);
    
        if(num == (TxBuffCnt-1))
        {
            /* Set ETH_DMATXDESC_TERM bit as transmitting End */
            DMATxDesc->Status = ETH_DMATXDESC_TERM;
        }
    }   
    ETH_DMA->TDTAR =  (uint32_t) DMATxDescTab;
}

/**
  * @brief  Get the bit flag of ETHERNET DMA Tx Desc.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  ETH_DMATxDescFlag: the flag of Tx descriptor status.
  *   Select one of the follwing values :
  *     @arg ETH_DMATXDESC_BUSY  : BUSY bit: descriptor is owned by DMA engine
  *     @arg ETH_DMATXDESC_INTC  : Interrupt on completetion
  *     @arg ETH_DMATXDESC_LSG   : Last Segment
  *     @arg ETH_DMATXDESC_FSG   : First Segment
  *     @arg ETH_DMATXDESC_DCRC  : Disable CRC
  *     @arg ETH_DMATXDESC_DPAD  : Disable Pad
  *     @arg ETH_DMATXDESC_TTSEN : Transmit Time Stamp Enable
  *     @arg ETH_DMATXDESC_TERM  : Transmit End of Ring
  *     @arg ETH_DMATXDESC_TCHM  : Second Address Chained
  *     @arg ETH_DMATXDESC_TTMSS : Tx Time Stamp Status
  *     @arg ETH_DMATXDESC_IPHE  : IP Header Error
  *     @arg ETH_DMATXDESC_ES    : Error summary
  *     @arg ETH_DMATXDESC_JT    : Jabber Timeout
  *     @arg ETH_DMATXDESC_FRMF  : Frame Flushed: DMA/MTL flushed the frame due to SW flush
  *     @arg ETH_DMATXDESC_IPPE  : IP Payload Error
  *     @arg ETH_DMATXDESC_LCA   : Loss of Carrier: carrier lost during tramsmission
  *     @arg ETH_DMATXDESC_NCA   : No Carrier: no carrier signal from the tranceiver
  *     @arg ETH_DMATXDESC_LCO   : Late Collision: transmission aborted due to collision
  *     @arg ETH_DMATXDESC_ECO   : Excessive Collision: transmission aborted after 16 collisions
  *     @arg ETH_DMATXDESC_VFRM  : VLAN Frame
  *     @arg ETH_DMATXDESC_COCNT : Collision Count 
  *     @arg ETH_DMATXDESC_EXD   : Excessive Deferral
  *     @arg ETH_DMATXDESC_UFE   : Underflow Error: late data arrival from the memory
  *     @arg ETH_DMATXDESC_DB    : Deferred Bit
  * @retval The current ETH_DMATxDescFlag selected bit status(SET or RESET).
  */
TypeState ETH_GetDMATxDescBitState(ETH_DMADESCTypeDef *DMATxDesc, uint32_t ETH_DMATxDescFlag)
{  
    if ((DMATxDesc->Status & ETH_DMATxDescFlag) != (uint32_t)RESET)
    {   
         /* ETH_DMATxDescFlag is set */
        return SET;
    }
    else
    {
        /* ETH_DMATxDescFlag is reset */
        return RESET;
    }
}

/**
  * @brief  Get the DMA Tx Desc collision count.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor                     
  * @retval The value of Transmit descriptor collision counter.
  */
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc)
{
    return ((DMATxDesc->Status & ETH_DMATXDESC_COCNT) >> ETH_DMATXDESC_COLLISION_COUNTSHIFT);
}

/**
  * @brief  Set the DMA Tx Desc Busy bit for DMA or CPU.
  * @param  DMATxDesc: Pointer on a Transmit descriptor
  * @retval None
  */
void ETH_SetDMATxDescBusyBit(ETH_DMADESCTypeDef *DMATxDesc)
{
    DMATxDesc->Status |= ETH_DMATXDESC_BUSY;
}

/**
  * @brief  Enable or disable the ETH_DMATXDESC_INTC control bit.
  * @param  DMATxDesc: Pointer to a Tx descriptor
  * @param  NewValue: new value of the ETH_DMATXDESC_INTC control bit.
  *   This parameter can be: ENABLE or DISABLE.                   
  * @retval None
  */
void ETH_DMATxDescTransmitINTConfig(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the DMA Tx Desc after the frame has been transmitted Set Transmit interrupt */
        DMATxDesc->Status |= ETH_DMATXDESC_INTC;
    }
    else
    {
        /* Disable the DMA Tx Desc after the frame has been transmitted Set Transmit interrupt */
        DMATxDesc->Status &=(~(uint32_t)ETH_DMATXDESC_INTC);
    }
}

/**
  * @brief  Enable or disable the DMATxDesc_FrameSegment control bit.
  * @param  DMATxDesc: Pointer to a Tx descriptor
  * @param  DMATxDesc_Segment: the actual Tx buffer contain first or last segment.
  *   Select one of the follwing values :
  *     @arg ETH_DMATXDESC_LASTSEGMENT  : current Tx desc selected contain last segment 
  *     @arg ETH_DMATXDESC_FIRSTSEGMENT : current Tx desc selected contain first segment                   
  * @retval None
  */
void ETH_SetDMATxDescFrameSegment(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Segment)
{  
    DMATxDesc->Status |= DMATxDesc_Segment;
}

/**
  * @brief  Set the DMA Tx Desc Checksum Insertion mode.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor 
  * @param  DMATxDesc_Checksum: the type of DMA Tx descriptor checksum insertion.
  *   Select one of the follwing values :
  *     @arg ETH_DMATXDESC_CHECKSUMDISABLE           : Checksum bypass
  *     @arg ETH_DMATXDESC_CHECKSUMIPV4HEADER        : IPv4 header checksum
  *     @arg ETH_DMATXDESC_CHECKSUMTCPUDPICMPSEGMENT : TCP/UDP/ICMP checksum. Pseudo header checksum is assumed to be present
  *     @arg ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL    : TCP/UDP/ICMP checksum fully in hardware including pseudo header                                                                
  * @retval None
  */
void ETH_SetDMATxDescChecksumInsertion(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Checksum)
{ 
    DMATxDesc->Status |= DMATxDesc_Checksum;
}

/**
  * @brief  Enable or disable the DMA Tx descriptor CRC function.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  NewValue: new value of the DMA Tx descriptor CRC function.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATxDescCRC_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the DMATxDesc CRC */
        DMATxDesc->Status &= (~(uint32_t)ETH_DMATXDESC_DCRC);
    }
    else
    {
        /* Disable the DMATxDesc CRC */
        DMATxDesc->Status |= ETH_DMATXDESC_DCRC; 
    }
}

/**
  * @brief  Enable or disable the DMA Tx descriptor end of ring.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  NewValue: new value of the DMA Tx descriptor end of ring.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATxDescEndOfRing_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the DMATxDesc end of ring */
        DMATxDesc->Status |= ETH_DMATXDESC_TERM;  
    }
    else
    {
        /* Disable the DMATxDesc end of ring */
        DMATxDesc->Status &= (~(uint32_t)ETH_DMATXDESC_TERM); 
    }
}

/**
  * @brief  Enable or disable the DMA Tx descriptor second address chained.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  NewValue: new value of the DMA Tx descriptor second address chained.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATxDescSecondAddressChained_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the DMATxDesc second address chained */
        DMATxDesc->Status |= ETH_DMATXDESC_TCHM;  
    }
    else
    {
        /* Disable the DMATxDesc second address chained */
        DMATxDesc->Status &=(~(uint32_t)ETH_DMATXDESC_TCHM); 
    }
}

/**
  * @brief  Enable or disable auto padding when transmit frame shorter than 64 bytes.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  NewValue: new value of the auto padding status.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATxDescShortFramePadding_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{ 
    if (NewValue != DISABLE)
    {
        /* Enable the DMATxDesc short frame padding */
        DMATxDesc->Status &= (~(uint32_t)ETH_DMATXDESC_DPAD);
    }
    else
    {
        /* Disable the DMATxDesc short frame padding */
        DMATxDesc->Status |= ETH_DMATXDESC_DPAD; 
    }
}

/**
  * @brief  Enable or disable the DMA Tx descriptor time stamp function.
  * @param  DMATxDesc: pointer to a DMA Tx descriptor
  * @param  NewValue: new value of the DMA Tx descriptor time stamp.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATxDescTimeStamp_Enable(ETH_DMADESCTypeDef *DMATxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {   
        /* Enable the DMATxDesc time stamp */
        DMATxDesc->Status |= ETH_DMATXDESC_TTSEN;  
    }
    else
    {
        /* Disable the DMATxDesc time stamp */
        DMATxDesc->Status &=(~(uint32_t)ETH_DMATXDESC_TTSEN); 
    }
}

/**
  * @brief  Set the frame length by configures the DMA Tx Desc buffer1 and buffer2 sizes.
  * @param  DMATxDesc: Pointer to a Tx descriptor
  * @param  Buffer1Size: the Tx buffer1 size.
  * @param  Buffer2Size: the Tx buffer2 size, set to 0 indicates it is not being used.
  * @retval None
  */
void ETH_SetDMATxDescBufferSize(ETH_DMADESCTypeDef *DMATxDesc, uint32_t Buffer1Size, uint32_t Buffer2Size)
{
    DMATxDesc->ControlBufferSize |= (Buffer1Size | (Buffer2Size << ETH_DMATXDESC_BUFFER2_SIZESHIFT));
}

/**
  * @brief  Initialize the DMA Rx descriptors's parameters in chain mode.
  * @param  DMARxDescTab: Pointer to the first Rx descriptor table 
  * @param  pRxBuff: Pointer to the first RxBuffer table
  * @param  RxBuffCnt: the used Rx desc num in the table
  * @retval None
  */
void ETH_DMARxDescChainModeInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *pRxBuff, uint32_t RxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMARxDesc;
  
