LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
    DMACurrentRxDesc = DMARxDescTab; 
    /* Configuration each DMARxDesc descriptor */
    for(num=0; num < RxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Rx Desc table */
        DMARxDesc = DMARxDescTab+num;
        DMARxDesc->Status = ETH_DMARXDESC_BUSY;

        /* Set TCH bit and buffer1 size */
        DMARxDesc->ControlBufferSize = ETH_DMARXDESC_RCHM | (uint32_t)ETH_MAX_FRAME_SIZE;  
        /* Set Buffer1 address pointer to application buffer */
        DMARxDesc->Buffer1Addr = (uint32_t)(&pRxBuff[num*ETH_MAX_FRAME_SIZE]);
    
        if(num < (RxBuffCnt-1))
        {
            /* Buffer2NextDescAddr equal to next descriptor address in the Rx Desc table */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab+num+1); 
        }
        else
        {
            /* When it is the last descriptor, Buffer2NextDescAddr equal to first descriptor address in the Rx Desc table */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab); 
        }
    }
   
    ETH_DMA->RDTAR = (uint32_t) DMARxDescTab;  
}

/**
  * @brief  Initialize the DMA Rx descriptors's parameters in ring mode.
  * @param  DMARxDescTab: Pointer to the first Rx descriptor table 
  * @param  pRxBuff1: Pointer to the first RxBuffer1 table 
  * @param  pRxBuff2: Pointer to the first RxBuffer2 table
  * @param  RxBuffCnt: the used Rx descriptor num in the table
  * @retval None
  */
void ETH_DMARxDescRingModeInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *pRxBuff1, uint8_t *pRxBuff2, uint32_t RxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMARxDesc;
    
    DMACurrentRxDesc = DMARxDescTab; 
    /* Configuration each DMARxDesc descriptor */  
    for(num=0; num < RxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Rx Desc table */
        DMARxDesc = DMARxDescTab+num; 
        DMARxDesc->Status = ETH_DMARXDESC_BUSY; 
        DMARxDesc->ControlBufferSize = ETH_MAX_FRAME_SIZE;  
        /* Set Buffer1 address pointer to application buffer1 */
        DMARxDesc->Buffer1Addr = (uint32_t)(&pRxBuff1[num*ETH_MAX_FRAME_SIZE]); 
    
        /* Set Buffer2 address pointer to application buffer2 */
        DMARxDesc->Buffer2NextDescAddr = (uint32_t)(&pRxBuff2[num*ETH_MAX_FRAME_SIZE]); 
        
        if(num == (RxBuffCnt-1))
        {
            /* Set ETH_DMARXDESC_RERR bit as Receive End */
            DMARxDesc->ControlBufferSize |= ETH_DMARXDESC_RERR;
        }
    }
   
    ETH_DMA->RDTAR = (uint32_t) DMARxDescTab;  
}

/**
  * @brief  Get the bit flag of ETHERNET Rx descriptor.
  * @param  DMARxDesc: pointer to a DMA Rx descriptor
  * @param  ETH_DMARxDescFlag: the flag of Rx descriptor status.
  *   Select one of the follwing values :
  *     @arg ETH_DMARXDESC_BUSY : Descriptor is owned by DMA engine 
  *     @arg ETH_DMARXDESC_DAFF : DA Filter Fail for the rx frame
  *     @arg ETH_DMARXDESC_ERRS : Error summary
  *     @arg ETH_DMARXDESC_DERR : Desciptor error: no more descriptors for receive frame
  *     @arg ETH_DMARXDESC_SAFF : SA Filter Fail for the received frame
  *     @arg ETH_DMARXDESC_LERR : Frame size not matching with length field
  *     @arg ETH_DMARXDESC_OERR : Overflow Error: Frame was damaged due to buffer overflow
  *     @arg ETH_DMARXDESC_VTAG : VLAN Tag: received frame is a VLAN frame
  *     @arg ETH_DMARXDESC_FDES : First descriptor of the frame
  *     @arg ETH_DMARXDESC_LDES : Last descriptor of the frame
  *     @arg ETH_DMARXDESC_IPHCERR : IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error 
  *     @arg ETH_DMARXDESC_LCO   : Late collision occurred during reception
  *     @arg ETH_DMARXDESC_FRMT  : Frame type - Ethernet, otherwise 802.3
  *     @arg ETH_DMARXDESC_RWDT  : Receive Watchdog Timeout: watchdog timer expired during reception
  *     @arg ETH_DMARXDESC_RERR  : Receive error: error reported by MII interface
  *     @arg ETH_DMARXDESC_DERR  : Dribble bit error: frame contains non int multiple of 8 bits
  *     @arg ETH_DMARXDESC_CERR  : CRC error
  *     @arg ETH_DMARXDESC_PCERR : Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error
  * @retval The current ETH_DMARxDescFlag selected bit status(SET or RESET).
  */
TypeState ETH_GetDMARxDescBitState(ETH_DMADESCTypeDef *DMARxDesc, uint32_t ETH_DMARxDescFlag)
{
    if ((DMARxDesc->Status & ETH_DMARxDescFlag) != (uint32_t)RESET)
    {
        /* ETH_DMARxDescFlag is set */
        return SET;
    }
    else
    {
        /* ETH_DMARxDescFlag is reset */
        return RESET;
    }
}

/**
  * @brief  Set the DMA Rx Desc busy bit for DMA or CPU
  * @param  DMARxDesc: Pointer to a Rx descriptor
  * @retval None
  */
void ETH_SetDMARxDescBusyBit(ETH_DMADESCTypeDef *DMARxDesc)
{
    DMARxDesc->Status |= ETH_DMARXDESC_BUSY;
}

/**
  * @brief  Get the DMA Rx Desc frame length.
  * @param  DMARxDesc: pointer to a DMA Rx descriptor                     
  * @retval Received frame length of the Rx descriptor selected.
  */
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc)
{
    return ((DMARxDesc->Status & ETH_DMARXDESC_FRML) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT);
}

/**
  * @brief  Enable or disable the DMA Rx descriptor receive interrupt.
  * @param  DMARxDesc: Pointer to a Rx descriptor
  * @param  NewValue: new value of the DMA Rx descriptor interrupt.
  *   This parameter can be: ENABLE or DISABLE.                   
  * @retval None
  */
void ETH_DMARxDescReceiveINTConfig(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the DMARxDesc receive interrupt */
        DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARXDESC_DINTC);
    }
    else
    {
        /* Disable the DMARxDesc receive interrupt */
        DMARxDesc->ControlBufferSize |= ETH_DMARXDESC_DINTC;
    }
}

/**
  * @brief  Enable or disable the DMA Rx descriptor end of ring.
  * @param  DMARxDesc: pointer to a DMA Rx descriptor
  * @param  NewValue: new value of the DMA Rx descriptor end of ring.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMARxDescEndOfRing_Enable(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue)
{ 
    if (NewValue != DISABLE)
    {
        /* Enable the DMARxDesc end of ring */
        DMARxDesc->ControlBufferSize |= ETH_DMARXDESC_RERR;  
    }
    else
    {
        /* Disable the DMARxDesc end of ring */
        DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARXDESC_RERR); 
    }
}

/**
  * @brief  Enable or disable the DMA Rx descriptor second address chained.
  * @param  DMARxDesc: pointer to a DMA Rx descriptor
  * @param  NewValue: new value of the DMA Rx descriptor second address chained.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMARxDescSecondAddressChained_Enable(ETH_DMADESCTypeDef *DMARxDesc, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {   
        /* Enable the DMARxDesc second address chained */ 
        DMARxDesc->ControlBufferSize |= ETH_DMARXDESC_RCHM;  
    }
    else
    {
        /* Disable the DMARxDesc second address chained */  
        DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARXDESC_RCHM); 
    }
}

/**
  * @brief  Get the ETHERNET DMA Rx Desc buffer size.
  * @param  DMARxDesc: pointer to a DMA Rx descriptor 
  * @param  DMARxDesc_BufferSelect: the DMA Rx descriptor buffer.
  *   Select one of the follwing values :
  *     @arg ETH_DMARXDESC_BUFFER1 : DMA Rx Desc Buffer1
  *     @arg ETH_DMARXDESC_BUFFER2 : DMA Rx Desc Buffer2                     
  * @retval The Receive descriptor selected buffer size(buffer1 or buffer2).
  */
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc, uint32_t DMARxDesc_BufferSelect)
{ 
    if(DMARxDesc_BufferSelect != ETH_DMARXDESC_BUFFER1)
    {
        return ((DMARxDesc->ControlBufferSize & ETH_DMARXDESC_RB2S) >> ETH_DMARXDESC_BUFFER2_SIZESHIFT); 
    }
    else
    {
        return (DMARxDesc->ControlBufferSize & ETH_DMARXDESC_RB1S); 
    }
}

/* DMA */
/**
  * @brief  Resets all MAC subsystem.
  * @param  None
  * @retval None
  */
void ETH_SoftReset(void)
{
    ETH_DMA->BCR |= ETH_DMA_BCR_SWR;
}

/**
  * @brief  Get the bit flag of ETHERNET software reset.
  * @param  None
  * @retval The current DMA Bus Mode register SWR bit status(SET or RESET).
  */
TypeState ETH_GetSoftResetStatus(void)
{
    if((ETH_DMA->BCR & ETH_DMA_BCR_SWR) != (uint32_t)RESET)
    {
        /* The ETH_DMA_BCR_SWR bit is set */
        return SET;
    }
    else
    {
        /* The ETH_DMA_BCR_SWR bit is reset */
        return RESET;
    }
}

/**
  * @brief  Get the bit flag of specified ETHERNET DMA.
  * @param  ETH_DMA_FLAG: the flag of ETHERNET DMA_STR register.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_FLAG_TST : Time-stamp trigger flag
  *     @arg ETH_DMA_FLAG_WUM : WUM flag 
  *     @arg ETH_DMA_FLAG_MSC : MSC flag 
  *     @arg ETH_DMA_FLAG_DATATRANSFERERROR : Error bits 0-data buffer, 1-desc. access
  *     @arg ETH_DMA_FLAG_READWRITEERROR    : Error bits 0-write trnsf, 1-read transfr
  *     @arg ETH_DMA_FLAG_ACCESSERROR       : Error bits 0-Rx DMA, 1-Tx DMA
  *     @arg ETH_DMA_FLAG_NIS : Normal interrupt summary flag
  *     @arg ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag  
  *     @arg ETH_DMA_FLAG_ER  : Early receive flag 
  *     @arg ETH_DMA_FLAG_FBE : Fatal bus error flag 
  *     @arg ETH_DMA_FLAG_ET  : Early transmit flag 
  *     @arg ETH_DMA_FLAG_RWT : Receive watchdog timeout flag 
  *     @arg ETH_DMA_FLAG_RPS : Receive process stopped flag 
  *     @arg ETH_DMA_FLAG_RBU : Receive buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_R   : Receive flag 
  *     @arg ETH_DMA_FLAG_TU  : Underflow flag 
  *     @arg ETH_DMA_FLAG_RO  : Overflow flag 
  *     @arg ETH_DMA_FLAG_TJT : Transmit jabber timeout flag 
  *     @arg ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_TPS : Transmit process stopped flag 
  *     @arg ETH_DMA_FLAG_T   : Transmit flag 
  * @retval The current ETH_DMA_FLAG selected bit status(SET or RESET).
  */
TypeState ETH_GetDMABitState(uint32_t ETH_DMA_FLAG)
{  
    if ((ETH_DMA->STR & ETH_DMA_FLAG) != (uint32_t)RESET)
    {
        /* ETH_DMA_FLAG is set */
        return SET;
    }
    else
    {
        /* ETH_DMA_FLAG is reset */
        return RESET;
    }
}

/**
  * @brief  Clear the ETHERNET¡¯s DMA bit flag.
  * @param  ETH_DMA_FLAG: the flag of ETH_DMA_STR register to clear.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_FLAG_NIS : Normal interrupt summary flag
  *     @arg ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag 
  *     @arg ETH_DMA_FLAG_ER  : Early receive flag 
  *     @arg ETH_DMA_FLAG_FBE : Fatal bus error flag 
  *     @arg ETH_DMA_FLAG_ETI : Early transmit flag 
  *     @arg ETH_DMA_FLAG_RWT : Receive watchdog timeout flag 
  *     @arg ETH_DMA_FLAG_RPS : Receive process stopped flag 
  *     @arg ETH_DMA_FLAG_RBU : Receive buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_R   : Receive flag 
  *     @arg ETH_DMA_FLAG_TU  : Transmit Underflow flag 
  *     @arg ETH_DMA_FLAG_RO  : Receive Overflow flag 
  *     @arg ETH_DMA_FLAG_TJT : Transmit jabber timeout flag 
  *     @arg ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_TPS : Transmit process stopped flag 
  *     @arg ETH_DMA_FLAG_T   : Transmit flag
  * @retval None
  */
void ETH_DMAClearBitState(uint32_t ETH_DMA_FLAG)
{
    ETH_DMA->STR = (uint32_t) ETH_DMA_FLAG;
}

/**
  * @brief  Get the bit flag of DMA interrupt.
  * @param  ETH_DMA_INT: the interrupt source flag of ETHERNET DMA_STR register.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_INT_TST : Time-stamp trigger interrupt
  *     @arg ETH_DMA_INT_WUM : WUM interrupt 
  *     @arg ETH_DMA_INT_MSC : MSC interrupt
  *     @arg ETH_DMA_INT_NIS : Normal interrupt summary 
  *     @arg ETH_DMA_INT_AIS : Abnormal interrupt summary  
  *     @arg ETH_DMA_INT_ER  : Early receive interrupt 
  *     @arg ETH_DMA_INT_FBE : Fatal bus error interrupt 
  *     @arg ETH_DMA_INT_ET  : Early transmit interrupt 
  *     @arg ETH_DMA_INT_RWT : Receive watchdog timeout interrupt 
  *     @arg ETH_DMA_INT_RPS : Receive process stopped interrupt 
  *     @arg ETH_DMA_INT_RBU : Receive buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_R   : Receive interrupt 
  *     @arg ETH_DMA_INT_TU  : Underflow interrupt 
  *     @arg ETH_DMA_INT_RO  : Overflow interrupt 
  *     @arg ETH_DMA_INT_TJT : Transmit jabber timeout interrupt 
  *     @arg ETH_DMA_INT_TBU : Transmit buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_TPS : Transmit process stopped interrupt 
  *     @arg ETH_DMA_INT_T   : Transmit interrupt 
  * @retval The current ETH_DMA_INT selected bit status(SET or RESET).
  */
TypeState ETH_GetDMAIntBitState(uint32_t ETH_DMA_INT)
{  
    if ((ETH_DMA->STR & ETH_DMA_INT) != (uint32_t)RESET)
    {
        /* ETH_DMA_INT is set */
        return SET;
    }
    else
    {
        /* ETH_DMA_INT is reset */
        return RESET;
    }
}

/**
  * @brief  Clear the ETHERNET¡¯s DMA IT bit flag.
  * @param  ETH_DMA_INT: the interrupt source flag of ETH_DMA_STR register to clear.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_INT_NIS : Normal interrupt summary 
  *     @arg ETH_DMA_INT_AIS : Abnormal interrupt summary  
  *     @arg ETH_DMA_INT_ER  : Early receive interrupt 
  *     @arg ETH_DMA_INT_FBE : Fatal bus error interrupt 
  *     @arg ETH_DMA_INT_ETI : Early transmit interrupt 
  *     @arg ETH_DMA_INT_RWT : Receive watchdog timeout interrupt 
  *     @arg ETH_DMA_INT_RPS : Receive process stopped interrupt 
  *     @arg ETH_DMA_INT_RBU : Receive buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_R   : Receive interrupt 
  *     @arg ETH_DMA_INT_TU  : Transmit Underflow interrupt 
  *     @arg ETH_DMA_INT_RO  : Receive Overflow interrupt 
  *     @arg ETH_DMA_INT_TJT : Transmit jabber timeout interrupt 
  *     @arg ETH_DMA_INT_TBU : Transmit buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_TPS : Transmit process stopped interrupt 
  *     @arg ETH_DMA_INT_T   : Transmit interrupt
  * @retval None
  */
void ETH_DMAClearIntBitState(uint32_t ETH_DMA_INT)
{
    ETH_DMA->STR = (uint32_t) ETH_DMA_INT;
}

/**
  * @brief  Get the DMA Transmit Process State.
  * @param  None
  * @retval The current DMA Transmit Process State:
  *   Select one of the follwing values :
  *     - ETH_DMA_TransmitProcess_Stopped   : Stopped - Reset or Stop Tx Command issued
  *     - ETH_DMA_TransmitProcess_Fetching  : Running - fetching the Tx descriptor 
  *     - ETH_DMA_TransmitProcess_Waiting   : Running - waiting for status
  *     - ETH_DMA_TransmitProcess_Reading   : unning - reading the data from host memory
  *     - ETH_DMA_TransmitProcess_Suspended : Suspended - Tx Desciptor unavailabe
  *     - ETH_DMA_TransmitProcess_Closing   : Running - closing Rx descriptor  
  */
uint32_t ETH_GetTransmitProcessState(void)
{
    return ((uint32_t)(ETH_DMA->STR & ETH_DMA_STR_TS)); 
}

/**
  * @brief  Get the DMA Receive Process State.
  * @param  None
  * @retval The current DMA Receive Process State:
  *   Select one of the follwing values :
  *     - ETH_DMA_ReceiveProcess_Stopped   : Stopped - Reset or Stop Rx Command issued
  *     - ETH_DMA_ReceiveProcess_Fetching  : Running - fetching the Rx descriptor 
  *     - ETH_DMA_ReceiveProcess_Waiting   : Running - waiting for packet
  *     - ETH_DMA_ReceiveProcess_Suspended : Suspended - Rx Desciptor unavailable
  *     - ETH_DMA_ReceiveProcess_Closing   : Running - closing descriptor
  *     - ETH_DMA_ReceiveProcess_Queuing   : Running - queuing the recieve frame into host memory  
  */
uint32_t ETH_GetReceiveProcessState(void)
{
    return ((uint32_t)(ETH_DMA->STR & ETH_DMA_STR_RS)); 
}

/**
  * @brief  Flush the ETHERNET transmit FIFO.
  * @param  None                
  * @retval None
  */
void ETH_CleanTransmitFIFO(void)
{
    /* Set the FTF bit for Flushing Transmit FIFO */
    ETH_DMA->CTLR |= ETH_DMA_CTLR_FTF;  
}

/**
  * @brief  Get the bit flag of ETHERNET transmit FIFO.
  * @param  None                
  * @retval The current ETHERNET flush transmit FIFO bit status(SET or RESET).
  */
TypeState ETH_GetFlushTransmitFIFOStatus(void)
{   
    if ((ETH_DMA->CTLR & ETH_DMA_CTLR_FTF) != (uint32_t)RESET)
    {
        /* Flush transmit FIFO bit is set */
        return SET;
    }
    else
    {
        /* Flush transmit FIFO bit is reset */
        return RESET;
    }
}

/**
  * @brief  Enable or disable the DMA transmission function.
  * @param  NewValue: new value of the DMA transmission status.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMATransmission_Enable(TypeState NewValue)
{   
    if (NewValue != DISABLE)
    {
        /* Set the STE bit for Enable the DMA transmission */
        ETH_DMA->CTLR |= ETH_DMA_CTLR_STE;  
    }
    else
    {
        /* Reset the STE bit for Disable the DMA transmission */
        ETH_DMA->CTLR &= ~ETH_DMA_CTLR_STE;
    }
}

/**
  * @brief  Enable or disable the DMA reception function.
  * @param  NewValue: new value of the DMA reception status.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMAReception_Enable(TypeState NewValue)
{   
    if (NewValue != DISABLE)
    {
        /* Enable DMA reception */
        ETH_DMA->CTLR |= ETH_DMA_CTLR_SRE;  
    }
    else
    {
        /* Disable DMA reception */
        ETH_DMA->CTLR &= ~ETH_DMA_CTLR_SRE;
    }
}

/**
  * @brief  Enable or disable the ETH_DMA_INT control bit.
  * @param  ETH_DMA_INT: the interrupt source flag of ETH_DMA_IER register.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_INT_NIS : Normal interrupt summary 
  *     @arg ETH_DMA_INT_AIS : Abnormal interrupt summary  
  *     @arg ETH_DMA_INT_ER  : Early receive interrupt 
  *     @arg ETH_DMA_INT_FBE : Fatal bus error interrupt 
  *     @arg ETH_DMA_INT_ET  : Early transmit interrupt 
  *     @arg ETH_DMA_INT_RWT : Receive watchdog timeout interrupt 
  *     @arg ETH_DMA_INT_RPS : Receive process stopped interrupt 
  *     @arg ETH_DMA_INT_RBU : Receive buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_R   : Receive interrupt 
  *     @arg ETH_DMA_INT_TU  : Underflow interrupt 
  *     @arg ETH_DMA_INT_RO  : Overflow interrupt 
  *     @arg ETH_DMA_INT_TJT : Transmit jabber timeout interrupt 
  *     @arg ETH_DMA_INT_TBU : Transmit buffer unavailable interrupt 
  *     @arg ETH_DMA_INT_TPS : Transmit process stopped interrupt 
  *     @arg ETH_DMA_INT_T   : Transmit interrupt
  * @param  NewValue: new value of the DMA interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ETH_DMAINTConfig(uint32_t ETH_DMA_INT, TypeState NewValue)
{  
    if (NewValue != DISABLE)
    {
        /* Enable the ETH_DMA_INT control bit */
        ETH_DMA->IER |= ETH_DMA_INT;
    }
    else
    {
        /* Disable the ETH_DMA_INT control bit */
        ETH_DMA->IER &=(~(uint32_t)ETH_DMA_INT);
    }
}

/**
  * @brief  Get the bit flag of ETHERNET DMA overflow.
  * @param  ETH_DMA_Overflow: the DMA overflow flag of ETHERNET DMA_MFBOCNT register.
  *   Select one of the follwing values :
  *     @arg ETH_DMA_OVERFLOW_RXFIFOCOUNTER : Overflow for FIFO Overflow Counter
  *     @arg ETH_DMA_OVERFLOW_MISSEDFRAMECOUNTER : Overflow for Missed Frame Counter
  * @retval The current ETHERNET DMA overflow Flag selected bit status(SET or RESET).
  */
TypeState ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow)
{ 
    if ((ETH_DMA->MFBOCNT & ETH_DMA_Overflow) != (uint32_t)RESET)
    {
        /* DMA overflow Flag is set */
        return SET;
    }
    else
    {
        /* DMA overflow Flag is reset */
        return RESET;
    }
}

/**
  * @brief  Get the DMA Rx value of overflow Missed Frame Counter.
  * @param  None
  * @retval The ETH_DMA_MFBOCNT register MFA bit value.
  */
uint32_t ETH_GetRxOverflowMissedFrameCounter(void)
{
    return ((uint32_t)((ETH_DMA->MFBOCNT & ETH_DMA_MFBOCNT_MSFA)>>ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT));
}

/**
  * @brief  Get the DMA value of Buffer unavailable Missed Frame Counter.
  * @param  None
  * @retval The ETH_DMA_MFBOCNT register MFC bit value.
  */
uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void)
{
    return ((uint32_t)(ETH_DMA->MFBOCNT) & ETH_DMA_MFBOCNT_MSFC);
}

/**
  * @brief  Get the DMA value of the current Tx desc start address.
  * @param  None
  * @retval The ETH_DMA_CTDAR register value.
  */
uint32_t ETH_GetCurrentTxDescStartAddress(void)
{
    return ((uint32_t)(ETH_DMA->CTDAR));
}

/**
  * @brief  Get the DMA value of the current Rx desc start address.
  * @param  None
  * @retval The ETH_DMA_CRDAR register value.
  */
uint32_t ETH_GetCurrentRxDescStartAddress(void)
{
    return ((uint32_t)(ETH_DMA->CRDAR));
}

/**
  * @brief  Get the DMA value of the current Tx buffer address.
  * @param  None
  * @retval The ETH_DMA_CTBAR register value. 
  */
uint32_t ETH_GetCurrentTxBufferAddress(void)
{
    return ((uint32_t)(ETH_DMA->CTBAR));
}

/**
  * @brief  Get the DMA value of the current Rx buffer address.
  * @param  None
  * @retval The ETH_DMA_CRBAR register value.
  */
uint32_t ETH_GetCurrentRxBufferAddress(void)
{
    return ((uint32_t)(ETH_DMA->CRBAR));
}

/**
  * @brief  Poll the DMA Transmission enable by writing any value to the ETH_DMA_TPER register.
  *   This will make the DMA to resume transmission.
  * @param  None
  * @retval None.
  */
void ETH_ResumeDMATransmission(void)
{
    ETH_DMA->TPER = 0;
}

/**
  * @brief  Poll the DMA Transmission enable by writing any value to the ETH_DMA_RPER register.
  *   This will make the DMA to resume reception.
  * @param  None
  * @retval None.
  */
void ETH_ResumeDMAReception(void)
{
    ETH_DMA->RPER = 0;
}

/* WUM */
/**
  * @brief  Reset Wakeup frame filter register pointer.
  * @param  None
  * @retval None
  */
void ETH_WakeUpFrameFilterRegisterReset(void)
{  
    /* Set WUFFRPR bit for Reseting the ETH_MAC_RWFFR register pointer to 0 */
    ETH_MAC->WUMR |= ETH_MAC_WUMR_WUFFRPR;  
}

/**
  * @brief  Set the remote wakeup frame registers.
  * @param  pBuffer: Pointer to remote WakeUp Frame Filter Register buffer data (8 words).
  * @retval None
  */
void ETH_SetWakeUpFrameFilterRegister(uint32_t *pBuffer)
{
    uint32_t num = 0;
  
