LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
    /* Set the PTP Time Update Low Register with subsecond value and sign */
    ETH_PTP->TMSLUR = Sign | SubSecondValue;   
}

/**
  * @brief  Set the system time Addend value(used only when the system time is configured
  * for Fine update mode).
  * @param  add: the PTP PTP_TSACNT Register value.
  * @retval None
  */
void ETH_SetPTPTimeStampAddend(uint32_t add)
{
    ETH_PTP->TSACNT = add;    
}

/**
  * @brief  Set the Target system Time values.
  * @param  HighReg_Value: the PTP Expected Time High Register value.
  * @param  LowReg_Value:  the PTP Expected Time Low Register value.
  * @retval None
  */
void ETH_SetPTPTargetTime(uint32_t HighReg_Value, uint32_t LowReg_Value)
{
    /* Set the PTP Expected Time High Register */
    ETH_PTP->ETHR = HighReg_Value;
    /* Set the PTP Expected Time Low Register */
    ETH_PTP->ETLR = LowReg_Value;    
}

/**
  * @brief  Read the value of PTP module register .
  * @param  ETH_PTPRegister: the PTP module register selected.
  *   Select one of the follwing values :
  *     @arg ETH_PTP_TSCTLR  : Sub-Second Increment Register 
  *     @arg ETH_PTP_SSINCR  : Sub-Second Increment Register 
  *     @arg ETH_PTP_TMSHR   : Time Stamp High Register
  *     @arg ETH_PTP_TMSLR   : Time Stamp Low Register 
  *     @arg ETH_PTP_TMSHUR  : Time Stamp High Update Register  
  *     @arg ETH_PTP_TMSLUR  : Time Stamp Low Update Register
  *     @arg ETH_PTP_TSACNT  : Time Stamp Addend Register
  *     @arg ETH_PTP_ETHR    : Target Time High Register 
  *     @arg ETH_PTP_ETLR    : Target Time Low Register 
  * @retval ETHERNET PTP Register selected value.
  */
uint32_t ETH_GetPTPRegister(uint32_t ETH_PTPRegister)
{
    return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_PTPRegister));
}

/**
  * @brief  Initialize the DMA Tx descriptors's parameters in chain mode with PTP.
  * @param  DMATxDescTab: Pointer to the first Tx descriptor table 
  * @param  DMAPTPTxDescTab: Pointer to the first PTP Tx descriptor table
  * @param  pTxBuff: Pointer to the first TxBuffer table
  * @param  TxBuffCnt: the used Tx descriptor sum in the table
  * @retval None
  */
void ETH_DMAPTPTxDescChainModeInit(ETH_DMADESCTypeDef *DMATxDescTab, ETH_DMADESCTypeDef *DMAPTPTxDescTab,
                                   uint8_t* pTxBuff, uint32_t TxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMATxDesc;
  
    DMACurrentTxDesc = DMATxDescTab;
    DMACurrentPTPTxDesc = DMAPTPTxDescTab;
    /* Configuration each DMATxDesc descriptor */      
    for(num=0; num < TxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Tx Desc table */
        DMATxDesc = DMATxDescTab+num;
        /* Set TCH bit and enable PTP with desc status */
        DMATxDesc->Status = ETH_DMATXDESC_TCHM | ETH_DMATXDESC_TTSEN;  
       
        /* Set Buffer1 address pointer to application buffer */
        DMATxDesc->Buffer1Addr =(uint32_t)(&pTxBuff[num*ETH_MAX_FRAME_SIZE]);
    
        if(num < (TxBuffCnt-1))
        {
            /* Buffer2NextDescAddr equal to next descriptor address in the Tx Desc table */
            DMATxDesc->Buffer2NextDescAddr = (uint32_t)(DMATxDescTab+num+1);
        }
        else
        {
            /* When it is the last descriptor, Buffer2NextDescAddr equal to first descriptor address in the Tx Desc table */ 
            DMATxDesc->Buffer2NextDescAddr = (uint32_t) DMATxDescTab;  
        }
        /* Set DMAPTPTxDescTab equal to DMATxDescTab */
        (&DMAPTPTxDescTab[num])->Buffer1Addr = DMATxDesc->Buffer1Addr;
        (&DMAPTPTxDescTab[num])->Buffer2NextDescAddr = DMATxDesc->Buffer2NextDescAddr;
    }
    /* When it is the last PTPdescriptor, DMAPTPTxDesc status equal to the first descriptor address in the PTPTx Desc list address */
    (&DMAPTPTxDescTab[num-1])->Status = (uint32_t) DMAPTPTxDescTab;

    ETH_DMA->TDTAR = (uint32_t) DMATxDescTab;
}

/**
  * @brief  Initialize the DMA Rx descriptors's parameters in chain mode with PTP.
  * @param  DMARxDescTab: Pointer to the first Rx descriptor table
  * @param  DMAPTPRxDescTab: Pointer to the first PTP Rx descriptor table
  * @param  pRxBuff: Pointer to the first RxBuffer table
  * @param  RxBuffCnt: the used Rx descriptor sum in the table
  * @retval None
  */
void ETH_DMAPTPRxDescChainModeInit(ETH_DMADESCTypeDef *DMARxDescTab, ETH_DMADESCTypeDef *DMAPTPRxDescTab,
                                   uint8_t *pRxBuff, uint32_t RxBuffCnt)
{
    uint32_t num = 0;
    ETH_DMADESCTypeDef *DMARxDesc;
  
    DMACurrentRxDesc = DMARxDescTab; 
    DMACurrentPTPRxDesc = DMAPTPRxDescTab;
    /* Configuration each DMARxDesc descriptor */ 
    for(num=0; num < RxBuffCnt; num++)
    {
        /* Get the pointer to the next descriptor of the Rx Desc table */
        DMARxDesc = DMARxDescTab+num;
        DMARxDesc->Status = ETH_DMARXDESC_BUSY;

        /* Set TCH bit and buffer1 size */
        DMARxDesc->ControlBufferSize = ETH_DMARXDESC_RCHM | (uint32_t)ETH_MAX_FRAME_SIZE;  
        /* Set Buffer1 address pointer to application buffer */
        DMARxDesc->Buffer1Addr = (uint32_t)(&pRxBuff[num*ETH_MAX_FRAME_SIZE]);
    
        if(num < (RxBuffCnt-1))
        {
        /* Buffer2NextDescAddr equal to next descriptor address in the Rx Desc table */
        DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab+num+1); 
        }
        else
        {
            /* When it is the last descriptor, Buffer2NextDescAddr equal to first descriptor address in the Rx Desc table */ 
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab); 
        }
        /* Set DMAPTPRxDescTab equal to DMARxDescTab */
        (&DMAPTPRxDescTab[num])->Buffer1Addr = DMARxDesc->Buffer1Addr;
        (&DMAPTPRxDescTab[num])->Buffer2NextDescAddr = DMARxDesc->Buffer2NextDescAddr;
    }
    /* When it is the last PTPdescriptor, DMAPTPRxDesc status equal to the first descriptor address in the PTPRx Desc table address */
    (&DMAPTPRxDescTab[num-1])->Status = (uint32_t) DMAPTPRxDescTab;

    /* Update Receive Desciptor Table Address Register */
    ETH_DMA->RDTAR = (uint32_t) DMARxDescTab;  
}

/**
  * @brief  Send data with Time Stamp values of application buffer as a transmit packet. 
  * @param  pbuf: pointer to the applicationbuffer.
  * @param  size: the application buffer size.
  * @param  PTPTxTab: Pointer to the first PTP Tx table to store Time stamp values.
  * @retval The transmission with PTP result(ERROR or SUCCESS) 
  */
uint32_t ETH_HandlePTPTxPkt(uint8_t *pbuf, uint16_t size, uint32_t *PTPTxTab)
{
    uint32_t offset = 0, timeout = 0;
    
    if((DMACurrentTxDesc->Status & ETH_DMATXDESC_BUSY) != (uint32_t)RESET)
    {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR;
    }
    for(offset=0; offset<size; offset++)
    {
        (*(__IO uint8_t *)((DMACurrentPTPTxDesc->Buffer1Addr) + offset)) = (*(pbuf + offset));
    }
    /* Setting the Frame Length */
    DMACurrentTxDesc->ControlBufferSize = (size & (uint32_t)0x1FFF);
    /* Setting the segment of frame (ETH_DMATXDESC_LSG and ETH_DMATXDESC_FSG are SET that frame is transmitted in one descriptor) */    
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_LSG | ETH_DMATXDESC_FSG;
    /* Enable the DMA transmission */
    DMACurrentTxDesc->Status |= ETH_DMATXDESC_BUSY;
    /* Check Tx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_TBU) != (uint32_t)RESET)
    {
        /* Clear TBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_TBU;
        /* Resume DMA transmission by writing to the TPER register*/
        ETH_DMA->TPER = 0;
    }
    /* Wait for ETH_DMATXDESC_TTMSS flag to be set unless timeout */
    do
    {
        timeout++;
    } while (!(DMACurrentTxDesc->Status & ETH_DMATXDESC_TTMSS) && (timeout < 0xFFFF));
    /* Return ERROR due to timeout */
    if(timeout == PHY_READ_TO)
    {
        return ERROR;
    }
    /* Clear the DMACurrentTxDesc status register TTSS flag */
    DMACurrentTxDesc->Status &= ~ETH_DMATXDESC_TTMSS;
    *PTPTxTab++ = DMACurrentTxDesc->Buffer1Addr;
    *PTPTxTab = DMACurrentTxDesc->Buffer2NextDescAddr;
    /* Update the ETHERNET DMA current Tx descriptor pointer to the next Tx decriptor in DMA Tx decriptor talbe*/  
    /* Chained Mode */
    if((DMACurrentTxDesc->Status & ETH_DMATXDESC_TCHM) != (uint32_t)RESET)
    {   
        DMACurrentTxDesc = (ETH_DMADESCTypeDef*) (DMACurrentPTPTxDesc->Buffer2NextDescAddr);
        if(DMACurrentPTPTxDesc->Status != 0)
        { 
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef*) (DMACurrentPTPTxDesc->Status);
        }
        else
        {
            DMACurrentPTPTxDesc++;
        }
    }
    /* Ring Mode */
    else 
    {  
        if((DMACurrentTxDesc->Status & ETH_DMATXDESC_TERM) != (uint32_t)RESET)
        {
            DMACurrentTxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->TDTAR); 
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->TDTAR);
        }
        else
        {
            DMACurrentTxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentTxDesc + ETH_DMATXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));      
            DMACurrentPTPTxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentPTPTxDesc + ETH_DMATXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));      
        }
    }
    return SUCCESS;
}

/**
  * @brief  Receive a packet data with Time Stamp values to application buffer.
  * @param  pbuf: Pointer on the application buffer.  
  * @param  PTPRxTab: Pointer to the first PTP Rx table to store Time stamp values.
  * @retval The Receive frame length with PTP(If size is equal to ERROR, the receiving unsuccessful)
  */
uint32_t ETH_HandlePTPRxPkt(uint8_t *pbuf, uint32_t *PTPRxTab)
{
    uint32_t offset = 0, size = 0;
    
