LiteOS/LiteOS/GD32F207_Library/FWLib/src/gd32f20x_eth.c
    if((DMACurrentRxDesc->Status & ETH_DMARXDESC_BUSY) != (uint32_t)RESET)
    {
        /* Return ERROR: the descriptor is busy due to own by the DMA */
        return ERROR;
    }
    if(((DMACurrentRxDesc->Status & ETH_DMARXDESC_ERRS) == (uint32_t)RESET) &&
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_LDES) != (uint32_t)RESET) &&
       ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FDES) != (uint32_t)RESET))
    {
        /* Get the Frame Length exclusive CRC */
        size = ((DMACurrentRxDesc->Status & ETH_DMARXDESC_FRML) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4;
        for(offset=0; offset<size; offset++)
        {
            (*(pbuf + offset)) = (*(__IO uint8_t *)((DMACurrentPTPRxDesc->Buffer1Addr) + offset));
        }
    }
    else
    {
        /* Return ERROR */
        size = ERROR;
    }
    /* Check Rx Buffer unavailable flag status */
    if ((ETH_DMA->STR & ETH_DMA_STR_RBU) != (uint32_t)RESET)
    {
        /* Clear RBU ETHERNET DMA flag */
        ETH_DMA->STR = ETH_DMA_STR_RBU;
        /* Resume DMA reception by writing to the RPER register*/
        ETH_DMA->RPER = 0;
    }
    *PTPRxTab++ = DMACurrentRxDesc->Buffer1Addr;
    *PTPRxTab = DMACurrentRxDesc->Buffer2NextDescAddr;
    /* Enable reception */
    DMACurrentRxDesc->Status |= ETH_DMARXDESC_BUSY;
    /* Update the ETHERNET DMA current Rx descriptor pointer to the next Rx decriptor in DMA Rx decriptor talbe*/      
    /* Chained Mode */
    if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RCHM) != (uint32_t)RESET)
    {
        DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (DMACurrentPTPRxDesc->Buffer2NextDescAddr);
        if(DMACurrentPTPRxDesc->Status != 0)
        {
            DMACurrentPTPRxDesc = (ETH_DMADESCTypeDef*) (DMACurrentPTPRxDesc->Status);
        }
        else
        {
            DMACurrentPTPRxDesc++;
        }
    }
    /* Ring Mode */
    else 
    {
        if((DMACurrentRxDesc->ControlBufferSize & ETH_DMARXDESC_RERR) != (uint32_t)RESET)
        {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) (ETH_DMA->RDTAR);
        }
        else
        {
            DMACurrentRxDesc = (ETH_DMADESCTypeDef*) ((uint32_t)DMACurrentRxDesc + ETH_DMARXDESC_SIZE + ((ETH_DMA->BCR & ETH_DMA_BCR_DPSL) >> 2));      
        }
    }
    /* Return Frame size or ERROR */
    return (size);
}

#ifndef USE_Delay
/**
  * @brief  Insert a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  */
static void ETH_Delay(__IO uint32_t nCount)
{
    __IO uint32_t time = 0; 
    
    for(time = nCount; time != 0; time--)
    {
    }
}
#endif /* USE_Delay */
#endif /* GD32F20X_CL */
/**
  * @}
  */

/**
  * @}
  */ 

/**
  * @}
  */

/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/
